In [1]:
# dependencies
import pandas as pd
import numpy as np

In [2]:
dataFilepath = "Resources/purchase_data.csv"
dataFilepath

'Resources/purchase_data.csv'

In [3]:
# import the data in the file at dataFilepath and make a data frame of it
purchaseData_df = pd.read_csv(dataFilepath)
purchaseData_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
# This is a groupby object of unique SNs:
SNs_df = purchaseData_df.groupby(["SN"])
SNs_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [5]:
# This makes a dataframe from SNs_df that shows each SN's
# total purchases, but which unfortunately leaves out gender
# because it can't be summed:
SNsTotalPurchases_df = pd.DataFrame(SNs_df.sum())
SNsTotalPurchases_df

               Purchase ID  Age  Item ID  Price
SN
Adairialis76           467   16      123   2.28
Adastirin33            142   35      175   4.48
Aeda94                 388   17      128   4.91
Aela59                  28   21      119   4.32
Aelaria33              630   23      171   1.79
...                    ...  ...      ...    ...
Yathecal82            1400   60      241   6.22
Yathedeu43             688   44      143   6.02
Yoishirrala98          572   17      145   4.58
Zhisrisu83             195   20       85   7.89
Zontibe81             1019   63      247   8.03

[576 rows x 4 columns]

In [6]:
# This makes a dataframe from SNs_df that shows how many 
# purchases each SN made:
SNsCountPurchases_df = pd.DataFrame(SNs_df.count())
SNsCountPurchases_df

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76             1    1       1        1          1      1
Adastirin33              1    1       1        1          1      1
Aeda94                   1    1       1        1          1      1
Aela59                   1    1       1        1          1      1
Aelaria33                1    1       1        1          1      1
...                    ...  ...     ...      ...        ...    ...
Yathecal82               3    3       3        3          3      3
Yathedeu43               2    2       2        2          2      2
Yoishirrala98            1    1       1        1          1      1
Zhisrisu83               2    2       2        2          2      2
Zontibe81                3    3       3        3          3      3

[576 rows x 6 columns]

In [7]:
# This starts with the same groupby object of unique SNs, but turns
# it into a DataFrame that retains each SN's gender:
SNsTotalByFirst_df = pd.DataFrame(SNs_df.first())
SNsTotalByFirst_df
# I'll need both of these later.

,Purchase ID,Age,Gender,Item ID,Item Name,Price
SN,,,,,,
Adairialis76,467,16,Male,123,Twilight's Carver,2.28
Adastirin33,142,35,Female,175,Woeful Adamantite Claymore,4.48
Aeda94,388,17,Male,128,"Blazeguard, Reach of Eternity",4.91
Aela59,28,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32
Aelaria33,630,23,Male,171,Scalpel,1.79
...,...,...,...,...,...,...
Yathecal82,125,20,Female,62,Piece Maker,1.87
Yathedeu43,93,22,Male,88,"Emberling, Defender of Delusions",3.75
Yoishirrala98,572,17,Female,145,Fiery Glass Crusader,4.58
Zhisrisu83,54,10,Male,25,Hero Cane,4.35
Zontibe81,17,21,Male,161,Devine,1.76

In [8]:
# 1. Count unique players
PNcount = len(SNs_df)
PNcount

576

In [9]:
# 2. Purchasing analysis
#    a. no. of unique items
itemCount = len(purchaseData_df["Item ID"].value_counts())
itemCount

179

In [10]:
#    b. avg purchase price
purchaseAvg = purchaseData_df["Price"].sum() / purchaseData_df["Price"].count()
showPurchaseAvg = "$" + str(round(float(purchaseAvg), 2))
showPurchaseAvg

'$3.05'

In [11]:
#    c. total no. of purchases
purchaseCount = purchaseData_df["SN"].count()
purchaseCount

780

In [12]:
#    d. total revenue
totalRevenue = purchaseData_df["Price"].sum()
showTotalRevenue = "$" + str(totalRevenue)
showTotalRevenue

'$2379.77'

In [13]:
# 3. Gender demographics

# This is a groupby object created to get total sales by gender
# (in the Price column). Ignore the sums of Purchase ID, Age,
# and Item ID, which are meaningless.
SalesByGender = purchaseData_df.groupby(["Gender"])
SalesByGender_df = pd.DataFrame(SalesByGender.sum())
SalesByGender_df

                       Purchase ID    Age  Item ID    Price
Gender
Female                       42870   2412     9659   361.94
Male                        255921  14942    60698  1967.64
Other / Non-Disclosed         5019    363     1212    50.19

In [14]:
# This is a groupby object of unique PNs by gender, 
# using the dataframe of unique SNs that retains gender...:
genderReport = SNsTotalByFirst_df.groupby(["Gender"])
# ...and making it a DataFrame:
genderReport_df = pd.DataFrame(genderReport.count())
genderReport_df

                       Purchase ID  Age  Item ID  Item Name  Price
Gender
Female                          81   81       81         81     81
Male                           484  484      484        484    484
Other / Non-Disclosed           11   11       11         11     11

In [15]:
#    a. pct and count of male players

In [16]:
# count
maleCount = int(genderReport_df.iloc[1][1])
maleCount

484

In [17]:
# percent
malePct = maleCount / PNcount
malePctShow = str(round(malePct*100,1))+"%"
malePctShow

'84.0%'

In [18]:
#    b. pct and count of female players

In [19]:
# count
femaleCount = int(genderReport_df.iloc[0][0])
femaleCount

81

In [20]:
# percent
femalePct = femaleCount / PNcount
femalePctShow = str(round(femalePct*100,1))+"%"
femalePctShow

'14.1%'

In [21]:
#    c. pct and count of other/non-disclosed gender players

In [22]:
# count
nonBinCount = int(genderReport_df.iloc[2][2])
nonBinCount

11

In [23]:
# percent
nonBinPct = nonBinCount / PNcount
nonBinPctShow = str(round(nonBinPct*100,1))+"%"
nonBinPctShow

'1.9%'

In [24]:
# 4. Purchasing analysis: gender
SalesCountByGender = purchaseData_df.groupby(["Gender"])
SalesCountByGender_df = pd.DataFrame(SalesCountByGender.count())
SalesCountByGender_df

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [25]:
#    a. male players

In [26]:
#         i. purchase count
salesCountMale = SalesCountByGender_df.loc['Male','SN']
salesCountMale

652

In [27]:
#        ii. total purchase value
salesMale = SalesByGender_df.loc['Male','Price']
salesMaleShow = "$"+str(round(float(salesMale),2))
salesMaleShow

'$1967.64'

In [28]:
#       iii. avg purchase price
salesAvgMale = salesMale / salesCountMale
salesAvgMaleShow = "$"+str(round(float(salesAvgMale),2))
salesAvgMaleShow

'$3.02'

In [29]:
#        iv. avg purchase total per person by gender
salesAvgPerMale = salesMale / maleCount
salesAvgPerMaleShow = "$"+str(round(float(salesAvgPerMale),2))
salesAvgPerMaleShow

'$4.07'

In [30]:
#    b. female players

In [31]:
#         i. purchase count
salesCountFemale = SalesCountByGender_df.loc['Female','SN']
salesCountFemale

113

In [32]:
#        ii. total purchase value
salesFemale = SalesByGender_df.loc['Female','Price']
salesFemaleShow = "$"+str(round(float(salesFemale),2))
salesFemaleShow

'$361.94'

In [33]:
#       iii. avg purchase price
salesAvgFemale = salesFemale / salesCountFemale
salesAvgFemaleShow = "$"+str(round(float(salesAvgFemale),2))
salesAvgFemaleShow

'$3.2'

In [34]:
#        iv. avg purchase total per person by gender
salesAvgPerFemale = salesFemale / femaleCount
salesAvgPerFemaleShow = "$"+str(round(float(salesAvgPerFemale),2))
salesAvgPerFemaleShow

'$4.47'

In [35]:
#    c. players of other/non-disclosed gender

In [36]:
#         i. purchase count
salesCountNonBin = SalesCountByGender_df.loc['Other / Non-Disclosed','SN']
salesCountNonBin

15

In [37]:
#        ii. total purchase value
salesNonBin = SalesByGender_df.loc['Other / Non-Disclosed','Price']
salesNonBinShow = "$"+str(round(float(salesNonBin),2))
salesNonBinShow

'$50.19'

In [38]:
#       iii. avg purchase price
salesAvgNonBin = salesNonBin / salesCountNonBin
salesAvgNonBinShow = "$"+str(round(float(salesAvgNonBin),2))
salesAvgNonBinShow

'$3.35'

In [39]:
#        iv. avg purchase total per person by gender
salesAvgPerNonBin = salesNonBin / nonBinCount
salesAvgPerNonBinShow = "$"+str(round(float(salesAvgPerNonBin),2))
salesAvgPerNonBinShow

'$4.56'

In [40]:
# 5. Age demographics in bins of 4 years: <10, 10-14, 15-19, und so weiter
#    a. purchase count
#    b. avg purchase price
#    c. total purchase value
#    d. avg purchase total per person by age group

In [41]:
# 6. Top spenders
#    a. identify the top five spenders by total purchase value
# using the dataframe SNsTotalPurchases_df
# and turning it into a new DataFrame:
SNsTop_df = SNsTotalPurchases_df.sort_values(by="Price", ascending=False)
SNsTop_df = SNsTop_df.head()
SNsTop_df = SNsTop_df.sort_index()
SNsTop_df

             Purchase ID  Age  Item ID  Price
SN
Chamjask73          1306   66      339  13.83
Idastidru52         1999   96      527  15.45
Iral74              2285   84      518  13.62
Iskadarya95          713   60      321  13.10
Lisosia93           1630  125      442  18.96

In [42]:
# This removes the extraneous Purchase ID, Age, and ItemID columns from SNsTop.

In [43]:
# This searches SNsCountPurchases_df for the top five spenders in SNsTop,
# returns how many purchases each of them made, and adds them to SNsTop.
# Now how do I do that?

In [44]:
#    b. and list in a table:
#         i. SN
#        ii. purchase count
#       iii. avg purchase price
#        iv. total purchase value

# how do I read total purchase price back in here?
# avg purchase price is just total / count but how do I do that?
topSNs = {"SN": [0, 1, 2, 3, 4], "purchase count": [26, 38, 42, 104, 12], "total purchase price": [316, 89, 76, 54, 32], "avg purchase price": total purchase price / purchase count}
topSNs_df = pd.DataFrame(data=topSNs)
topSNs_df

SyntaxError: invalid syntax (<ipython-input-44-ba70736b3636>, line 9)

In [ ]:
# 7. Most popular items
#    a. identify the five most popular items purchase count
#    b. and list in a table:
#         i. item ID
#        ii. item name
#       iii. purchase count
#        iv. total purchase value

In [52]:
itemsCount = purchaseData_df.groupby(["Item ID"])
itemsCount_df = pd.DataFrame(itemsCount.count())
itemsCount_df

         Purchase ID  SN  Age  Gender  Item Name  Price
Item ID
0                  4   4    4       4          4      4
1                  4   4    4       4          4      4
2                  6   6    6       6          6      6
3                  6   6    6       6          6      6
4                  5   5    5       5          5      5
...              ...  ..  ...     ...        ...    ...
178               12  12   12      12         12     12
179                6   6    6       6          6      6
181                5   5    5       5          5      5
182                3   3    3       3          3      3
183                3   3    3       3          3      3

[179 rows x 6 columns]

In [48]:
itemsTop_df = itemsCount_df.sort_values(by="Price", ascending=False)
itemsTop_df = itemsTop_df.head()
itemsTop_df

# strike Purchase ID and Age and add name

         Purchase ID  Age  Price
Item ID
92              6371  266  59.99
178             4960  287  50.76
82              2761  215  44.10
145             4345  187  41.22
103             3947  178  34.80

In [50]:
# This shows how much revenue each in-game item generated:
itemsSales = purchaseData_df.groupby(["Item ID"])
itemsSales_df = pd.DataFrame(itemsSales.sum())
itemsSales_df

         Purchase ID  Age  Price
Item ID
0               1149   74   5.12
1               1523   89  11.77
2               2006  143  14.88
3               2087  155  14.94
4               1885  124   8.50
...              ...  ...    ...
178             4960  287  50.76
179             1948  126  26.88
181             1278  109   8.30
182             1327   67  12.09
183             1488   66   3.27

[179 rows x 3 columns]

In [51]:
# 8 most profitable items
#    a. identify the five most profitable items by total purchase value
#    b. and list in a table:
#         i. item ID
#        ii. item name
#       iii. purchase count
#        iv. item price
#         v. total purchase value

itemsTop_df = itemsSales_df.sort_values(by="Price", ascending=False)
itemsTop_df = itemsTop_df.head()
itemsTop_df

# strike Purchase ID and Age and add name

         Purchase ID  Age  Price
Item ID
92              6371  266  59.99
178             4960  287  50.76
82              2761  215  44.10
145             4345  187  41.22
103             3947  178  34.80

In [ ]:
# Thank you for examining this homework assignment (nunber 4: Pandas challenge)
# in the U of Minnesota Data Analytics and Visualization Boot Camp, Winter 2021.
# Please email Paul Bernhardt papadiscobravo@gmail.com with questions.